In [ ]:
# ans to the question no 1
import pandas as pd 
df = pd.read_csv("D:/chrome/customer_data.csv")

In [ ]:
# ans to the question no 2
df.head(n = 5)

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
0,Dr.,Ray,Morton,sebvajom@kol.km,Male,38,Medtronic Inc.,Health Therapist,(987) 619-2695,B6V 3W3,MB,5020000000000230,05/2018,Solo,8.36,Blue,126.23.139.2,Sunday,pm,04/05/1930
1,Miss,Claudia,Rodriquez,acu@jatsot.ug,Female,51,"Ames Department Stores, Inc.",Health Therapist,(356) 736-7352,G7M 5F3,SK,5020000000000230,07/2028,Visa,68.31,Black,106.198.76.211,Tuesday,am,12/20/1926
2,Miss,Harry,Meyer,zuz@lo.wf,Female,51,CSX Corp.,Political Scientist,(539) 246-1806,A0Z 6P9,NS,6300000000000000,02/2023,Switch,34.65,Black,186.150.187.29,Wednesday,pm,08/20/1931
3,Miss,Edith,Gilbert,hansohsi@jupec.md,Female,55,Murphy Oil Corporation,Transportation Manager,(984) 962-7494,P9I 9H3,YT,3530000000000000,02/2028,Maestro,64.59,White,80.140.57.161,Saturday,am,06/18/2001
4,Dr.,Lura,Murphy,webediti@je.st,Female,20,PETsMART Inc,Statistician,(902) 568-9748,S1A 6K0,ON,4030000000000000,10/2025,Diners Club International,20.83,Yellow,211.103.43.41,Friday,pm,06/14/2045

In [55]:
# ans to the question no 3
column_size = len(df.columns)
row_size = len(df)
column_size
row_size

30000

In [56]:
# ans to the question no 3 
df.shape

(30000, 20)

In [57]:
# ans to the question no 4 
df['age'].agg(['min','max','mean'])

min     18.000000
max     65.000000
mean    41.550067
Name: age, dtype: float64

In [ ]:
# draft
df['prefix'].value_counts().head(3)

prefix
Mrs.    7676
Mr.     7460
Miss    7440
Name: count, dtype: int64

In [ ]:
# draft
df['first'].value_counts().head(3)

first
Willie     130
Francis    124
Eula        86
Name: count, dtype: int64

In [60]:
# ans to the  question no 5
df['Full_name'] = df[['prefix','first','last']].agg(''.join,axis=1)
df.head()
df['Full_name'].value_counts().head(3)

Full_name
Mr.CallieMcCormick    3
Mrs.PaulineBowers     3
Dr.GavinWalsh         2
Name: count, dtype: int64

In [61]:
# ans  to the qs no 6
df.loc[df['phone'].duplicated(keep=False),['phone','Full_name']]

             phone       Full_name
15  (263) 382-8004  Mrs.LillyTyler
16  (263) 382-8004   Mrs.PeterCain

In [62]:
# ans to the question no 7 
(df['profession'] == 'Structural Engineer').sum()

87

In [63]:
# ans to the question no 8
((df['profession'] == 'Structural Engineer') & (df['gender'] == 'Male')).sum()

43

In [64]:
# ans to the question no 9
((df['profession'] == 'Structural Engineer') & (df['gender'] == 'Female') & (df['province'] == 'AB')).sum()

4

In [65]:
# ans to the question no 10
df['price(CAD)'].agg(['max','min','mean'])

max     100.000000
min       0.000000
mean     49.990775
Name: price(CAD), dtype: float64

In [66]:
# ans to the question no 11
df.loc[df['price(CAD)'] == 0,['Full_name']]

            Full_name
5320    Dr.BruceBryan
10597  Mrs.FloraClark

In [67]:
# ans to the question no 12  
df.loc[df['price(CAD)'] >= 100,['Full_name']]

                 Full_name
76        Mrs.GregoryBrown
21093  Mrs.CodyChristensen
24385      MissLizzieDixon

In [68]:
# ans to the question no 13
df.loc[df['cc_no'] == 5020000000000230,['email']]

             email
0  sebvajom@kol.km
1    acu@jatsot.ug

In [85]:
# ans to the question no 14
df['cc_exp'] = pd.to_datetime(df['cc_exp'], format='%m/%Y', errors='coerce')
df['cc_exp'].dt.year
[(df['cc_exp'] < '2019-01').sum()]

[2691]

In [70]:
# ans to the question no 15
(df['cc_type'] == 'Visa').sum()

1721

In [71]:
# ans to the question no 16
df.loc[((df['cc_type'] == 'Visa') & (df['price(CAD)'] == 100)).sum(),['Full_name']]

Full_name    MissClaudiaRodriquez
Name: 1, dtype: object

In [72]:
# ans to the question no 17
df['profession'].value_counts().head(2)

profession
Preschool Teacher       112
Distribution Manager    107
Name: count, dtype: int64

In [73]:
# ans to the question no 18
df['email_domain'] = df['email'].str.split('@').str[1]
df['email_domain'].value_counts().head(5)

email_domain
gmail.com      1687
me.com         1676
outlook.com    1664
live.com       1660
hotmail.com    1659
Name: count, dtype: int64

In [74]:
# ans to the question no 19 
df.loc[(df['email_domain'] == 'am.edu'),['Full_name']]

               Full_name
150  MissLorettaFletcher

In [75]:
# ans to the question no 20
df['weekday'].value_counts().head(1)

weekday
Saturday    4376
Name: count, dtype: int64